-- -*- M2-comint -*- hash: -470257883

i1 : compar = foreignFunctionPointerType("compar", int, {voidstar, voidstar})

o1 = compar

o1 : ForeignFunctionPointerType

i2 : f = (a, b) -> value int a - value int b

o2 = f

o2 : FunctionClosure

i3 : intcmp = compar f

o3 = int32(*f)(void*,void*)

o3 : ForeignObject of type compar

i4 : qsort = foreignFunction("qsort", void, {voidstar, ulong, ulong, compar})

o4 = qsort

o4 : ForeignFunction

i5 : x = (4 * int) {4, 2, 3, 1}

o5 = {4, 2, 3, 1}

o5 : ForeignObject of type int32[4]

i6 : qsort(x, 4, size int, intcmp)

i7 : x

o7 = {1, 2, 3, 4}

o7 : ForeignObject of type int32[4]

i8 : (value intcmp)(address int 5, address int 6)

o8 = -1

o8 : ForeignObject of type int32

i9 : 
